<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"04c604816131e8d23e8ea7f3686731a19cf39cffabb8a9026e1d1ac45b5a6eb4","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1373 at https://github.com/cal-itp/data-infra/actions/runs/21190322094","plan_out_hash":"d9f540ef0cc25399f9a43d88e801e404ce695457dab85b213d1306742d7c1d95","plan_hash":"badb0ce3f371dd334c8a3d7944696ba9511498f057704c6f88f0ff1f2494b36f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/gtfs_schedule_v2/gtfs_schedule_json_outcomes/gtfs_schedule_fare_media_txt_json_outcomes.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "tVDtsw==" -> (known after apply)
!~      detect_md5hash      = "vaiSpx3G+0Q3UzTeLUnHPQ==" -> "different hash"
!~      generation          = 1768942321025094 -> (known after apply)
        id                  = "calitp-staging-composer-dags/create_external_tables/gtfs_schedule_v2/gtfs_schedule_json_outcomes/gtfs_schedule_fare_media_txt_json_outcomes.yml"
!~      md5hash             = "vaiSpx3G+0Q3UzTeLUnHPQ==" -> (known after apply)
        name                = "dags/create_external_tables/gtfs_schedule_v2/gtfs_schedule_json_outcomes/gtfs_schedule_fare_media_txt_json_outcomes.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_rt_service_summary.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/fct_daily_rt_service_summary.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/fct_daily_rt_service_summary.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_schedule_rt_operator_summary.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "l9noWA==" -> (known after apply)
!~      detect_md5hash      = "YPR8RCbDP+ch619DW5fUfg==" -> "different hash"
!~      generation          = 1764958875732306 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_daily_schedule_rt_operator_summary.sql"
!~      md5hash             = "YPR8RCbDP+ch619DW5fUfg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_schedule_rt_operator_summary.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_scheduled_stops.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "1Ov+Gw==" -> (known after apply)
!~      detect_md5hash      = "P3B3MIve07T9KXPDDGaG4w==" -> "different hash"
!~      generation          = 1768514562384401 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
!~      md5hash             = "P3B3MIve07T9KXPDDGaG4w==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_rollup/fct_operator_hourly_summary.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "BtMLPA==" -> (known after apply)
!~      detect_md5hash      = "H2TXaFSjej92sWnfOj7heA==" -> "different hash"
!~      generation          = 1767398108323912 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs_rollup/fct_operator_hourly_summary.sql"
!~      md5hash             = "H2TXaFSjej92sWnfOj7heA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_rollup/fct_operator_hourly_summary.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/transit_database/bridge_gtfs_analysis_name_x_ntd.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "LIVPqQ==" -> (known after apply)
!~      detect_md5hash      = "bcqmDtp08aQKoz48oIAKkA==" -> "different hash"
!~      generation          = 1767398107869322 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/transit_database/bridge_gtfs_analysis_name_x_ntd.sql"
!~      md5hash             = "bcqmDtp08aQKoz48oIAKkA==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database/bridge_gtfs_analysis_name_x_ntd.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1373](https://github.com/cal-itp/data-infra/actions/runs/21190322094)